Title: Multiple Conditional Statements   
Slug: multiple_conditional_statements  
Summary: Multiple Conditional Statements in SQL. 
Date: 2017-01-16 12:00  
Category: SQL  
Tags: Basics  
Authors: Chris Albon  

Note: This tutorial was written using [Catherine Devlin's SQL in Jupyter Notebooks library](https://github.com/catherinedevlin/ipython-sql). If you have not using a Jupyter Notebook, you can ignore the two lines of code below and any line containing `%%sql`. Furthermore, This tutorial uses SQLite's flavor of SQL, your version might have some differences in syntax.

For more, check out [Learning SQL](http://amzn.to/2jRriHj) by Alan Beaulieu.

In [1]:
# Ignore
%load_ext sql
%sql sqlite://
%config SqlMagic.feedback = False

## Create Data

In [2]:
%%sql

-- Create a table of criminals
CREATE TABLE criminals (pid, name, age, sex, city, minor);
INSERT INTO criminals VALUES (412, 'James Smith', 15, 'M', 'Santa Rosa', 1);
INSERT INTO criminals VALUES (901, 'Gordon Ado', 32, 'F', 'San Francisco', 0);
INSERT INTO criminals VALUES (512, 'Bill Byson', 21, 'M', 'Petaluma', 0);

[]

## View All Rows

In [3]:
%%sql

--  Select all
SELECT *

-- From the criminals table
FROM criminals

[(412, 'James Smith', 15, 'M', 'Santa Rosa', 1),
 (412, 'James Smith', 15, 'M', 'Santa Rosa', 1),
 (412, 'James Smith', 15, 'M', 'Santa Rosa', 1),
 (901, 'Gordon Ado', 32, 'F', 'San Francisco', 0),
 (512, 'Bill Byson', 21, 'M', 'Petaluma', 0)]

## View Rows Where Age Is Greater Than 20 And City Is San Francisco

In [4]:
%%sql

--  Select all unique
SELECT distinct *

-- From the criminals table
FROM criminals

-- Where age is greater than 20 and city is San Francisco
WHERE age > 20 AND city == 'San Francisco'

[(901, 'Gordon Ado', 32, 'F', 'San Francisco', 0)]

## View Rows Where Age Is Greater Than 20 or City Is San Francisco

In [5]:
%%sql

--  Select all unique
SELECT distinct *

-- From the criminals table
FROM criminals

-- Where age is greater than 20 and city is San Francisco
WHERE age > 20 OR city == 'San Francisco'

[(901, 'Gordon Ado', 32, 'F', 'San Francisco', 0),
 (512, 'Bill Byson', 21, 'M', 'Petaluma', 0)]